<?php
/*
左右どちらから読んでも同じ値になる数を回文数という.
2桁の数の積で表される回文数のうち, 最大のものは 9009 = 91 × 99 である.

では, 3桁の数の積で表される回文数の最大値を求めよ.
*/
$max = 0;
$n1  = 0;
$n2  = 0;

// n1
for ($b1 = 1; $b1 <= 9; $b1++) {
	for ($c1 = 0; $c1 <= 9; $c1++) {
		for ($d1 = 0; $d1 <= 9; $d1++) {
			// n2
			for ($b2 = 1; $b2 <= 9; $b2++) {
				for ($c2 = 0; $c2 <= 9; $c2++) {
					for ($d2 = 0; $d2 <= 9; $d2++) {

						$a1 = 100 * $b1 + 10 * $c1 + $d1;
						$a2 = 100 * $b2 + 10 * $c2 + $d2;

						$answer = $a1 * $a2;
						if ($answer == strrev($answer)) {
							if ($max < $answer) {
								$max = $answer;
								$n1  = $a1;
								$n2  = $a2;
							}
						}
					}
				}
			}
		}
	}
}

echo "$n1 * $n2 = $max" . PHP_EOL;
